; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v6)
             (pred_11 ?v5 ?v10)
             (pred_5 ?v8 ?v10)
             (pred_12 ?v7 ?v8 )
	     (pred_10 ?v8)
             (pred_1 ?v1)
             (pred_6 ?v5)
             (pred_2 ?v10)
             (pred_8 ?v8)
             (pred_4 ?v5)
             (pred_3 ?v8)
             (pred_9 ))



(:action op_1
:parameters (?v11 ?v2 ?v3 ?v9)
:precondition (and (pred_1 ?v11) (pred_1 ?v2) (pred_6 ?v3) (pred_2 ?v9)
          (pred_7 ?v11 ?v2) (pred_11 ?v3 ?v9)
                   (pred_5 ?v2 ?v9) (pred_10 ?v11) 
                   (pred_8 ?v2) (pred_4 ?v3))
:effect (and  (pred_3 ?v2) (not (pred_8 ?v2))))


(:action op_3
:parameters (?v11 ?v12)
:precondition (and (pred_1 ?v11) (pred_1 ?v12)
               (pred_10 ?v11) (pred_7 ?v11 ?v12) (pred_3 ?v12))
:effect (and (pred_10 ?v12) (not (pred_10 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_1 ?v11) (pred_6 ?v3) 
                  (pred_10 ?v11) (pred_12 ?v3 ?v11) (pred_9 ))
:effect (and (pred_4 ?v3)
   (not (pred_12 ?v3 ?v11)) (not (pred_9 ))))


(:action op_2
:parameters (?v11 ?v13 ?v4)
:precondition (and (pred_1 ?v11) (pred_6 ?v13) (pred_6 ?v4)
                  (pred_10 ?v11) (pred_4 ?v4) (pred_12 ?v13 ?v11))
:effect (and (pred_4 ?v13) (pred_12 ?v4 ?v11)
        (not (pred_4 ?v4)) (not (pred_12 ?v13 ?v11))))

(:action op_5
:parameters (?v11 ?v3)
:precondition (and (pred_1 ?v11) (pred_6 ?v3) 
                  (pred_10 ?v11) (pred_4 ?v3))
:effect (and (pred_9 ) (pred_12 ?v3 ?v11) (not (pred_4 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_03 obj_09 obj_08 obj_02 obj_20 obj_18 obj_13 obj_14 obj_11 obj_19 obj_21 obj_04 obj_01 obj_17 obj_06
    obj_07 obj_15
    obj_16 obj_12 obj_10
    )

    (:init
       (pred_9)

       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_13)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_21)
       (pred_1 obj_04)
       (pred_1 obj_01)
       (pred_1 obj_17)
       (pred_1 obj_06)
       (pred_2 obj_07)
       (pred_2 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_12)
       (pred_6 obj_10)

       (pred_7 obj_05 obj_02)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_08)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_08 obj_13)
       (pred_7 obj_08 obj_09)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_02 obj_20)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_20 obj_18)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_02)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_13 obj_08)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_21 obj_13)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_06 obj_21)
       (pred_7 obj_06 obj_17)
       (pred_8 obj_06)
       (pred_8 obj_18)
       (pred_8 obj_17)
       (pred_5  obj_06 obj_07)
       (pred_5  obj_18 obj_15)
       (pred_5  obj_17 obj_07)
       (pred_3 obj_05)
       (pred_3 obj_03)
       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_02)
       (pred_3 obj_20)
       (pred_3 obj_13)
       (pred_3 obj_14)
       (pred_3 obj_11)
       (pred_3 obj_19)
       (pred_3 obj_21)
       (pred_3 obj_04)
       (pred_3 obj_01)

       (pred_11  obj_16 obj_07)
       (pred_11  obj_12 obj_15)
       (pred_11  obj_10 obj_07)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_10 obj_05)
       (pred_10 obj_01)
    )

    (:goal (and
       (pred_12 obj_16 obj_04)
       (pred_12 obj_10 obj_08)
    ))
(:constraints
  (always (not (pred_10 obj_14)))
)
)

; plan
1. (op_3 obj_01 obj_11)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_11)
   goals met: 0 of 2
2. (op_3 obj_11 obj_20)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_20)
   goals met: 0 of 2
3. (op_3 obj_20 obj_02)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_02)
   goals met: 0 of 2
4. (op_3 obj_02 obj_05)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_05)
   goals met: 0 of 2
5. (op_4 obj_05 obj_10)
   deleted: (pred_12 obj_10 obj_05) (pred_9)
   added: (pred_4 obj_10)
   goals met: 0 of 2
6. (op_3 obj_05 obj_03)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_03)
   goals met: 0 of 2
7. (op_3 obj_03 obj_09)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_09)
   goals met: 0 of 2
8. (op_3 obj_09 obj_08)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_08)
   goals met: 0 of 2
9. (op_5 obj_08 obj_10)
   deleted: (pred_4 obj_10)
   added: (pred_9) (pred_12 obj_10 obj_08)
   goals met: 1 of 2
10. (op_3 obj_08 obj_09)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_09)
   goals met: 1 of 2
11. (op_3 obj_09 obj_03)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_03)
   goals met: 1 of 2
12. (op_3 obj_03 obj_05)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_05)
   goals met: 1 of 2
13. (op_3 obj_05 obj_02)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_02)
   goals met: 1 of 2
14. (op_4 obj_02 obj_16)
   deleted: (pred_12 obj_16 obj_02) (pred_9)
   added: (pred_4 obj_16)
   goals met: 1 of 2
15. (op_3 obj_02 obj_20)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_20)
   goals met: 1 of 2
16. (op_3 obj_20 obj_11)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_11)
   goals met: 1 of 2
17. (op_3 obj_11 obj_01)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_01)
   goals met: 1 of 2
18. (op_3 obj_01 obj_04)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_04)
   goals met: 1 of 2
19. (op_5 obj_04 obj_16)
   deleted: (pred_4 obj_16)
   added: (pred_9) (pred_12 obj_16 obj_04)
   goals met: 2 of 2
